# StairsSupportTrimSupportUpper Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsSupportTrimSupportUpper Property
ParameterTypeId Class See Also
---
"Trim Support at Upper": Trim Support at Upper
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsSupportTrimSupportUpper { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsSupportTrimSupportUpper As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsSupportTrimSupportUpper {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace